// SPDX-License-Identifier: GPL-3.0

pragma solidity >=0.8.2 <0.9.0;

// 91. 배열에서 특정 요소를 없애는 함수를 구현하세요. 
// 예) [4,3,2,1,8] 3번째를 없애고 싶음 → [4,3,1,8]

// 92. 특정 주소를 받았을 때, 그 주소가 EOA인지 CA인지 감지하는 함수를 구현하세요.

// 93. 다른 컨트랙트의 함수를 사용해보려고 하는데, 그 함수의 이름은 모르고 methodId로 추정되는 값은 있다. input 값도 uint256 1개, address 1개로 추정될 때 해당 함수를 활용하는 함수를 구현하세요.

// 94. inline - 더하기, 빼기, 곱하기, 나누기하는 함수를 구현하세요.

// 95. inline - 3개의 값을 받아서, 더하기, 곱하기한 결과를 반환하는 함수를 구현하세요.

// 96. inline - 4개의 숫자를 받아서 가장 큰수와 작은 수를 반환하는 함수를 구현하세요.

// 97. inline - 상태변수 숫자만 들어가는 동적 array numbers에 push하고 pop하는 함수 그리고 전체를 반환하는 구현하세요.

// 98. inline - 상태변수 문자형 letter에 값을 넣는 함수 setLetter를 구현하세요..

// 99. inline - bytes4형 b의 값을 정하는 함수 setB를 구현하세요.

// 100. inline - bytes형 변수 b의 값을 정하는 함수 setB를 구현하세요.